"""
運転免許証
"""
from __future__ import annotations
class x: ...

def マイナンバーカードの受け取り_at支所():
    if x.ハガキ:
        本人確認物 = (x.免許証, x.ハガキ)
    else:
        本人確認物 = (x.免許証, x.その他自宅への郵便物)
    x.住所確認など()

    保険証とマイナンバーカードの紐付け()

    def 保険証とマイナンバーカードの紐付け():
        # 何したか忘れたが、特別なことはしていない
        ...

def 運転免許とマイナンバーカードの紐付け():
    x.免許試験場へ行く()
    x.受付で希望を伝える(希望="マイナ免許証と免許証の２枚持ち")
    x.カードリーダーにマイナンバーカードをセットし読み取り()
    証紙 = 証紙発行機で証紙を発行()
    証紙, 申請書 = x.支払いをして証紙に支払い支払い切手を貼ってもらう(証紙, yen=1500)
    申請書.必要事項を記入("日付", "氏名", "希望形態", "生年月日")

    x.カードリーダでマイナンバーカードへの情報書き込み()

    def 証紙発行機で証紙を発行():
        x.免許証を読み込み
        x.マイナンバーカードを読み込み
        return x.証紙


    x.個人でマイナポータルから設定()
